app/controllers/group_events_controller.rb

    def new
        # @group_event = GroupEvent.new
        @user = User.find_by(id: 1)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def index
        @group_events = GroupEvent.all
---
SELECT "group_events".* FROM "group_events" WHERE "group_events"."deleted_at" IS NULL

    def create
        @user = User.find_by(id: 1)

        @group_event = @user.group_events.new(events_params)

        @group_event.status = @group_event.event_publish_able? ? 1 : 0

            respond_to do |format|
            if @group_event.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "group_events" ("name", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Hello"], ["description", ""], ["user_id", 1], ["created_at", "2020-11-05 22:26:31.097695"], ["updated_at", "2020-11-05 22:26:31.097695"]]

    def update
        @group_event.update_attributes! events_params
---
UPDATE "group_events" SET "start_date" = $1, "duration" = $2, "description" = $3, "updated_at" = $4 WHERE "group_events"."id" = $5  [["start_date", "2020-11-12 00:00:00"], ["duration", 212], ["description", "<p>asas</p>"], ["updated_at", "2020-11-06 00:23:01.047487"], ["id", 3]]

    def set_group_event
        @group_event = GroupEvent.find(params[:id])
---
SELECT  "group_events".* FROM "group_events" WHERE "group_events"."deleted_at" IS NULL AND "group_events"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]